susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F091.h
/*
  * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
*/

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define CAN_RX_PA11_ PA11,GPIO_AF4
#define CAN_RX_PB8_ PB8,GPIO_AF4
#define CAN_RX_PD0_ PD0,GPIO_AF0
#define _CAN_RX_PA11_ 1
#define _CAN_RX_PB8_ 1
#define _CAN_RX_PD0_ 1

#define CAN_TX_PA12_ PA12,GPIO_AF4
#define CAN_TX_PB9_ PB9,GPIO_AF4
#define CAN_TX_PD1_ PD1,GPIO_AF0
#define _CAN_TX_PA12_ 1
#define _CAN_TX_PB9_ 1
#define _CAN_TX_PD1_ 1

#define CEC_PA5_ PA5,GPIO_AF1
#define CEC_PB10_ PB10,GPIO_AF0
#define CEC_PB8_ PB8,GPIO_AF0
#define _CEC_PA5_ 1
#define _CEC_PB10_ 1
#define _CEC_PB8_ 1

#define COMP1_OUT_PA0_ PA0,GPIO_AF7
#define COMP1_OUT_PA11_ PA11,GPIO_AF7
#define COMP1_OUT_PA6_ PA6,GPIO_AF7
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1

#define COMP2_OUT_PA12_ PA12,GPIO_AF7
#define COMP2_OUT_PA2_ PA2,GPIO_AF7
#define COMP2_OUT_PA7_ PA7,GPIO_AF7
#define _COMP2_OUT_PA12_ 1
#define _COMP2_OUT_PA2_ 1
#define _COMP2_OUT_PA7_ 1

#define CRS_SYNC_PA8_ PA8,GPIO_AF4
#define CRS_SYNC_PD15_ PD15,GPIO_AF0
#define CRS_SYNC_PF0_ PF0,GPIO_AF0
#define _CRS_SYNC_PA8_ 1
#define _CRS_SYNC_PD15_ 1
#define _CRS_SYNC_PF0_ 1

#define EVENTOUT_PA1_ PA1,GPIO_AF0
#define EVENTOUT_PA11_ PA11,GPIO_AF0
#define EVENTOUT_PA12_ PA12,GPIO_AF0
#define EVENTOUT_PA15_ PA15,GPIO_AF3
#define EVENTOUT_PA6_ PA6,GPIO_AF6
#define EVENTOUT_PA7_ PA7,GPIO_AF6
#define EVENTOUT_PA8_ PA8,GPIO_AF3
#define EVENTOUT_PB0_ PB0,GPIO_AF0
#define EVENTOUT_PB11_ PB11,GPIO_AF0
#define EVENTOUT_PB12_ PB12,GPIO_AF1
#define EVENTOUT_PB3_ PB3,GPIO_AF1
#define EVENTOUT_PB4_ PB4,GPIO_AF2
#define EVENTOUT_PB9_ PB9,GPIO_AF3
#define EVENTOUT_PC0_ PC0,GPIO_AF0
#define EVENTOUT_PC1_ PC1,GPIO_AF0
#define EVENTOUT_PC2_ PC2,GPIO_AF0
#define EVENTOUT_PC3_ PC3,GPIO_AF0
#define EVENTOUT_PC4_ PC4,GPIO_AF0
#define EVENTOUT_PE0_ PE0,GPIO_AF1
#define EVENTOUT_PE1_ PE1,GPIO_AF1
#define EVENTOUT_PF2_ PF2,GPIO_AF0
#define EVENTOUT_PF3_ PF3,GPIO_AF0
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA15_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB3_ 1
#define _EVENTOUT_PB4_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PE0_ 1
#define _EVENTOUT_PE1_ 1
#define _EVENTOUT_PF2_ 1
#define _EVENTOUT_PF3_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF1
#define I2C1_SCL_PB8_ PB8,GPIO_AF1
#define I2C1_SCL_PF1_ PF1,GPIO_AF1
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1
#define _I2C1_SCL_PF1_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF1
#define I2C1_SDA_PB9_ PB9,GPIO_AF1
#define I2C1_SDA_PF0_ PF0,GPIO_AF1
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1
#define _I2C1_SDA_PF0_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF3
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PA11_ PA11,GPIO_AF5
#define I2C2_SCL_PB10_ PB10,GPIO_AF1
#define I2C2_SCL_PB13_ PB13,GPIO_AF5
#define _I2C2_SCL_PA11_ 1
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PA12_ PA12,GPIO_AF5
#define I2C2_SDA_PB11_ PB11,GPIO_AF1
#define I2C2_SDA_PB14_ PB14,GPIO_AF5
#define _I2C2_SDA_PA12_ 1
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2S1_CK_PA5_ PA5,GPIO_AF0
#define I2S1_CK_PB3_ PB3,GPIO_AF0
#define I2S1_CK_PE13_ PE13,GPIO_AF1
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PE13_ 1

#define I2S1_MCK_PA6_ PA6,GPIO_AF0
#define I2S1_MCK_PB4_ PB4,GPIO_AF0
#define I2S1_MCK_PE14_ PE14,GPIO_AF1
#define _I2S1_MCK_PA6_ 1
#define _I2S1_MCK_PB4_ 1
#define _I2S1_MCK_PE14_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF0
#define I2S1_SD_PB5_ PB5,GPIO_AF0
#define I2S1_SD_PE15_ PE15,GPIO_AF1
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB5_ 1
#define _I2S1_SD_PE15_ 1

#define I2S1_WS_PA15_ PA15,GPIO_AF0
#define I2S1_WS_PA4_ PA4,GPIO_AF0
#define I2S1_WS_PE12_ PE12,GPIO_AF1
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PE12_ 1

#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB13_ PB13,GPIO_AF0
#define I2S2_CK_PD1_ PD1,GPIO_AF1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PD1_ 1

#define I2S2_MCK_PB14_ PB14,GPIO_AF0
#define I2S2_MCK_PC2_ PC2,GPIO_AF1
#define I2S2_MCK_PD3_ PD3,GPIO_AF1
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PC2_ 1
#define _I2S2_MCK_PD3_ 1

#define I2S2_SD_PB15_ PB15,GPIO_AF0
#define I2S2_SD_PC3_ PC3,GPIO_AF1
#define I2S2_SD_PD4_ PD4,GPIO_AF1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF0
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PD0_ PD0,GPIO_AF1
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PD0_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF0
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PA9_ PA9,GPIO_AF5
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PA9_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF0
#define SPI1_MISO_PB4_ PB4,GPIO_AF0
#define SPI1_MISO_PE14_ PE14,GPIO_AF1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PE14_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF0
#define SPI1_MOSI_PB5_ PB5,GPIO_AF0
#define SPI1_MOSI_PE15_ PE15,GPIO_AF1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF0
#define SPI1_NSS_PA4_ PA4,GPIO_AF0
#define SPI1_NSS_PE12_ PE12,GPIO_AF1
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PE12_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF0
#define SPI1_SCK_PB3_ PB3,GPIO_AF0
#define SPI1_SCK_PE13_ PE13,GPIO_AF1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PE13_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF0
#define SPI2_MISO_PC2_ PC2,GPIO_AF1
#define SPI2_MISO_PD3_ PD3,GPIO_AF1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF0
#define SPI2_MOSI_PC3_ PC3,GPIO_AF1
#define SPI2_MOSI_PD4_ PD4,GPIO_AF1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF0
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF1
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1

