susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F091.h
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF0
#define SPI2_SCK_PD1_ PD1,GPIO_AF1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1

#define SYS_SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_SWCLK_PA14_ 1

#define SYS_SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_SWDIO_PA13_ 1

#define TIM14_CH1_PA4_ PA4,GPIO_AF4
#define TIM14_CH1_PA7_ PA7,GPIO_AF4
#define TIM14_CH1_PB1_ PB1,GPIO_AF0
#define _TIM14_CH1_PA4_ 1
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PB1_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF0
#define TIM15_BKIN_PB12_ PB12,GPIO_AF5
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PB12_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF0
#define TIM15_CH1_PB14_ PB14,GPIO_AF1
#define TIM15_CH1_PF9_ PF9,GPIO_AF0
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PF9_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF5
#define TIM15_CH1N_PB15_ PB15,GPIO_AF3
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB15_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF0
#define TIM15_CH2_PB15_ PB15,GPIO_AF1
#define TIM15_CH2_PF10_ PF10,GPIO_AF0
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PF10_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF2
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF5
#define TIM16_CH1_PB8_ PB8,GPIO_AF2
#define TIM16_CH1_PE0_ PE0,GPIO_AF0
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PE0_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF2
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF0
#define TIM17_BKIN_PB4_ PB4,GPIO_AF5
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF5
#define TIM17_CH1_PB9_ PB9,GPIO_AF2
#define TIM17_CH1_PE1_ PE1,GPIO_AF0
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB9_ 1
#define _TIM17_CH1_PE1_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF2
#define _TIM17_CH1N_PB7_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF2
#define TIM1_BKIN_PB12_ PB12,GPIO_AF2
#define TIM1_BKIN_PE15_ PE15,GPIO_AF0
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF2
#define TIM1_CH1_PE9_ PE9,GPIO_AF0
#define _TIM1_CH1_PA8_ 1
#define _TIM1_CH1_PE9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF2
#define TIM1_CH1N_PB13_ PB13,GPIO_AF2
#define TIM1_CH1N_PE8_ PE8,GPIO_AF0
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF2
#define TIM1_CH2_PE11_ PE11,GPIO_AF0
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF2
#define TIM1_CH2N_PB14_ PB14,GPIO_AF2
#define TIM1_CH2N_PE10_ PE10,GPIO_AF0
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF2
#define TIM1_CH3_PE13_ PE13,GPIO_AF0
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF2
#define TIM1_CH3N_PB15_ PB15,GPIO_AF2
#define TIM1_CH3N_PE12_ PE12,GPIO_AF0
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF2
#define TIM1_CH4_PE14_ PE14,GPIO_AF0
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PE14_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF2
#define TIM1_ETR_PE7_ PE7,GPIO_AF0
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF2
#define TIM2_CH1_PA15_ PA15,GPIO_AF2
#define TIM2_CH1_PA5_ PA5,GPIO_AF2
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF2
#define TIM2_CH2_PB3_ PB3,GPIO_AF2
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF2
#define TIM2_CH3_PB10_ PB10,GPIO_AF2
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF2
#define TIM2_CH4_PB11_ PB11,GPIO_AF2
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF2
#define TIM2_ETR_PA15_ PA15,GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF1
#define TIM3_CH1_PB4_ PB4,GPIO_AF1
#define TIM3_CH1_PC6_ PC6,GPIO_AF0
#define TIM3_CH1_PE3_ PE3,GPIO_AF0
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1
#define _TIM3_CH1_PE3_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF1
#define TIM3_CH2_PB5_ PB5,GPIO_AF1
#define TIM3_CH2_PC7_ PC7,GPIO_AF0
#define TIM3_CH2_PE4_ PE4,GPIO_AF0
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1
#define _TIM3_CH2_PE4_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF1
#define TIM3_CH3_PC8_ PC8,GPIO_AF0
#define TIM3_CH3_PE5_ PE5,GPIO_AF0
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1
#define _TIM3_CH3_PE5_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF1
#define TIM3_CH4_PC9_ PC9,GPIO_AF0
#define TIM3_CH4_PE6_ PE6,GPIO_AF0
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1
#define _TIM3_CH4_PE6_ 1

#define TIM3_ETR_PD2_ PD2,GPIO_AF0
#define TIM3_ETR_PE2_ PE2,GPIO_AF0
#define _TIM3_ETR_PD2_ 1
#define _TIM3_ETR_PE2_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC5_ PC5,GPIO_AF0
#define _TSC_G3_IO1_PC5_ 1

#define TSC_G3_IO2_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO2_PB0_ 1

#define TSC_G3_IO3_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO3_PB1_ 1

#define TSC_G3_IO4_PB2_ PB2,GPIO_AF3
#define _TSC_G3_IO4_PB2_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA11_ PA11,GPIO_AF3
#define _TSC_G4_IO3_PA11_ 1

#define TSC_G4_IO4_PA12_ PA12,GPIO_AF3
#define _TSC_G4_IO4_PA12_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

