susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F091.h
#define UART8_CK_PD12_ PD12,GPIO_AF2
#define _UART8_CK_PD12_ 1

#define UART8_RTS_PD12_ PD12,GPIO_AF2
#define _UART8_RTS_PD12_ 1

#define UART8_RX_PC3_ PC3,GPIO_AF2
#define UART8_RX_PC9_ PC9,GPIO_AF1
#define UART8_RX_PD14_ PD14,GPIO_AF0
#define _UART8_RX_PC3_ 1
#define _UART8_RX_PC9_ 1
#define _UART8_RX_PD14_ 1

#define UART8_TX_PC2_ PC2,GPIO_AF2
#define UART8_TX_PC8_ PC8,GPIO_AF1
#define UART8_TX_PD13_ PD13,GPIO_AF0
#define _UART8_TX_PC2_ 1
#define _UART8_TX_PC8_ 1
#define _UART8_TX_PD13_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF1
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF1
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF1
#define _USART1_DE_PA12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF1
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF1
#define USART1_RX_PB7_ PB7,GPIO_AF0
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF1
#define USART1_TX_PB6_ PB6,GPIO_AF0
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF1
#define USART2_CK_PD7_ PD7,GPIO_AF0
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF1
#define USART2_CTS_PD3_ PD3,GPIO_AF0
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF1
#define USART2_DE_PD4_ PD4,GPIO_AF0
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF1
#define USART2_RTS_PD4_ PD4,GPIO_AF0
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA15_ PA15,GPIO_AF1
#define USART2_RX_PA3_ PA3,GPIO_AF1
#define USART2_RX_PD6_ PD6,GPIO_AF0
#define _USART2_RX_PA15_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA14_ PA14,GPIO_AF1
#define USART2_TX_PA2_ PA2,GPIO_AF1
#define USART2_TX_PD5_ PD5,GPIO_AF0
#define _USART2_TX_PA14_ 1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB0_ PB0,GPIO_AF4
#define USART3_CK_PB12_ PB12,GPIO_AF4
#define USART3_CK_PC12_ PC12,GPIO_AF1
#define USART3_CK_PD10_ PD10,GPIO_AF0
#define _USART3_CK_PB0_ 1
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PA6_ PA6,GPIO_AF4
#define USART3_CTS_PB13_ PB13,GPIO_AF4
#define USART3_CTS_PD11_ PD11,GPIO_AF0
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_DE_PB1_ PB1,GPIO_AF4
#define USART3_DE_PB14_ PB14,GPIO_AF4
#define USART3_DE_PD12_ PD12,GPIO_AF0
#define USART3_DE_PD2_ PD2,GPIO_AF1
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PD2_ 1

#define USART3_RTS_PB1_ PB1,GPIO_AF4
#define USART3_RTS_PB14_ PB14,GPIO_AF4
#define USART3_RTS_PD12_ PD12,GPIO_AF0
#define USART3_RTS_PD2_ PD2,GPIO_AF1
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF4
#define USART3_RX_PC11_ PC11,GPIO_AF1
#define USART3_RX_PC5_ PC5,GPIO_AF1
#define USART3_RX_PD9_ PD9,GPIO_AF0
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF4
#define USART3_TX_PC10_ PC10,GPIO_AF1
#define USART3_TX_PC4_ PC4,GPIO_AF1
#define USART3_TX_PD8_ PD8,GPIO_AF0
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1
#define _USART3_TX_PD8_ 1

#define USART4_CK_PC12_ PC12,GPIO_AF0
#define _USART4_CK_PC12_ 1

#define USART4_CTS_PB7_ PB7,GPIO_AF4
#define _USART4_CTS_PB7_ 1

#define USART4_DE_PA15_ PA15,GPIO_AF4
#define _USART4_DE_PA15_ 1

#define USART4_RTS_PA15_ PA15,GPIO_AF4
#define _USART4_RTS_PA15_ 1

#define USART4_RX_PA1_ PA1,GPIO_AF4
#define USART4_RX_PC11_ PC11,GPIO_AF0
#define USART4_RX_PE9_ PE9,GPIO_AF1
#define _USART4_RX_PA1_ 1
#define _USART4_RX_PC11_ 1
#define _USART4_RX_PE9_ 1

#define USART4_TX_PA0_ PA0,GPIO_AF4
#define USART4_TX_PC10_ PC10,GPIO_AF0
#define USART4_TX_PE8_ PE8,GPIO_AF1
#define _USART4_TX_PA0_ 1
#define _USART4_TX_PC10_ 1
#define _USART4_TX_PE8_ 1

#define USART5_CK_PB5_ PB5,GPIO_AF4
#define USART5_CK_PE7_ PE7,GPIO_AF1
#define _USART5_CK_PB5_ 1
#define _USART5_CK_PE7_ 1

#define USART5_DE_PB5_ PB5,GPIO_AF4
#define USART5_DE_PE7_ PE7,GPIO_AF1
#define _USART5_DE_PB5_ 1
#define _USART5_DE_PE7_ 1

#define USART5_RTS_PB5_ PB5,GPIO_AF4
#define USART5_RTS_PE7_ PE7,GPIO_AF1
#define _USART5_RTS_PB5_ 1
#define _USART5_RTS_PE7_ 1

#define USART5_RX_PB4_ PB4,GPIO_AF4
#define USART5_RX_PD2_ PD2,GPIO_AF2
#define USART5_RX_PE11_ PE11,GPIO_AF1
#define _USART5_RX_PB4_ 1
#define _USART5_RX_PD2_ 1
#define _USART5_RX_PE11_ 1

#define USART5_TX_PB3_ PB3,GPIO_AF4
#define USART5_TX_PC12_ PC12,GPIO_AF2
#define USART5_TX_PE10_ PE10,GPIO_AF1
#define _USART5_TX_PB3_ 1
#define _USART5_TX_PC12_ 1
#define _USART5_TX_PE10_ 1

#define USART6_CK_PF3_ PF3,GPIO_AF2
#define _USART6_CK_PF3_ 1

#define USART6_RTS_PF3_ PF3,GPIO_AF2
#define _USART6_RTS_PF3_ 1

#define USART6_RX_PA5_ PA5,GPIO_AF5
#define USART6_RX_PC1_ PC1,GPIO_AF2
#define USART6_RX_PF10_ PF10,GPIO_AF1
#define _USART6_RX_PA5_ 1
#define _USART6_RX_PC1_ 1
#define _USART6_RX_PF10_ 1

#define USART6_TX_PA4_ PA4,GPIO_AF5
#define USART6_TX_PC0_ PC0,GPIO_AF2
#define USART6_TX_PF9_ PF9,GPIO_AF1
#define _USART6_TX_PA4_ 1
#define _USART6_TX_PC0_ 1
#define _USART6_TX_PF9_ 1

#define USART7_CK_PD15_ PD15,GPIO_AF2
#define USART7_CK_PF2_ PF2,GPIO_AF2
#define _USART7_CK_PD15_ 1
#define _USART7_CK_PF2_ 1

#define USART7_RTS_PD15_ PD15,GPIO_AF2
#define USART7_RTS_PF2_ PF2,GPIO_AF2
#define _USART7_RTS_PD15_ 1
#define _USART7_RTS_PF2_ 1

#define USART7_RX_PC1_ PC1,GPIO_AF1
#define USART7_RX_PC7_ PC7,GPIO_AF1
#define USART7_RX_PF3_ PF3,GPIO_AF1
#define _USART7_RX_PC1_ 1
#define _USART7_RX_PC7_ 1
#define _USART7_RX_PF3_ 1

#define USART7_TX_PC0_ PC0,GPIO_AF1
#define USART7_TX_PC6_ PC6,GPIO_AF1
#define USART7_TX_PF2_ PF2,GPIO_AF1
#define _USART7_TX_PC0_ 1
#define _USART7_TX_PC6_ 1
#define _USART7_TX_PF2_ 1

#define USART8_CK_PD12_ PD12,GPIO_AF2
#define _USART8_CK_PD12_ 1

#define USART8_RTS_PD12_ PD12,GPIO_AF2
#define _USART8_RTS_PD12_ 1

#define USART8_RX_PC3_ PC3,GPIO_AF2
#define USART8_RX_PC9_ PC9,GPIO_AF1
#define USART8_RX_PD14_ PD14,GPIO_AF0
#define _USART8_RX_PC3_ 1
#define _USART8_RX_PC9_ 1
#define _USART8_RX_PD14_ 1

#define USART8_TX_PC2_ PC2,GPIO_AF2
#define USART8_TX_PC8_ PC8,GPIO_AF1
#define USART8_TX_PD13_ PD13,GPIO_AF0
#define _USART8_TX_PC2_ 1
#define _USART8_TX_PC8_ 1
#define _USART8_TX_PD13_ 1

#define USB_OE_PA13_ PA13,GPIO_AF2
#define _USB_OE_PA13_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */